import json
import jdatetime
import collections
import pandas as pd
import datetime
import subprocess 
import requests
from bs4 import BeautifulSoup
from wordcloud import WordCloud
import random
import json
import os
import matplotlib.pyplot as plt

dir_path = os.path.dirname(os.path.realpath(__file__))

_total=['',datetime.datetime.now()]
f=open('statistics/Hospital.csv','r',encoding='UTF-8',errors='ignore') 
_hospital=f.readlines()
f.close()
def Total():
    if _total[0]=='' or datetime.datetime.now()-datetime.timedelta(hours=1)>_total[1]:
        with open('statistics/sum.csv','r') as csvFile:
            rows=csvFile.readlines()
            _total[0]=dict(zip(rows[0].split(',')[1:],map(int,rows[-1].split(',')[1:])))
            _total[1]=datetime.datetime.now()
    return _total[0]

_todayStatis=['',datetime.datetime.now()]
def TodayStatis():
    if _todayStatis[0]=='' or datetime.datetime.now()-datetime.timedelta(hours=1)>_todayStatis[1]:
        with open('statistics/days.csv','r') as csvFile:
            rows=csvFile.readlines()
            _todayStatis[0]=dict(zip(rows[0].split(',')[1:],map(int,rows[-1].split(',')[1:])))
            _todayStatis[1]=datetime.datetime.now()
    return _todayStatis[0]

_summery=['',datetime.datetime.now()]
def Summery():
    if _summery[0]=='' or datetime.datetime.now()-datetime.timedelta(hours=1)>_summery[1]:
        with open('statistics/sum.csv','r') as csvFile:
            rows=csvFile.readlines()
            _summery[0]=sum(map(int,rows[-1].split(',')[1:]))
            _summery[1]=datetime.datetime.now()
    return 23049,8376,1812

def PrettyPrint(x):
    x=sorted(x.items(),key=lambda item: item[1])
    x.reverse()
    x=collections.OrderedDict(x)
    return '\n'.join("{}-{} : {:,} نفر".format(index+1, k.replace('\n',''),int(v)) for index,(k,v) in enumerate(x.items()) )

def Today():
    _today=jdatetime.date.today()
    year=_today.year
    month=_today.month
    day=_today.day
    return '{}/{:02}/{:02}'.format(year,month,day)

_world=['',datetime.datetime.now()]
def World():
    if _world[0]=='' or datetime.datetime.now()-datetime.timedelta(hours=1)>_world[1]:
        try:
            pd.options.mode.chained_assignment = None
            data = pd.read_html('https://www.worldometers.info/coronavirus/',)
            data_cases=data[-1]
            data_cases = data_cases[['Country,Other', 'TotalCases' ,'NewCases','TotalDeaths','TotalRecovered']]
            data_cases.rename(columns={"Country,Other" : "Country",'TotalCases' : 'Total','NewCases' :'New', 'TotalDeaths':"Deaths","TotalRecovered":"Recovered"},inplace = True)
            total=data_cases.tail(1)
            data_cases=data_cases[:10]
            _world[0]="World coronavirus statistics {}\n{}\n{}".format(datetime.datetime.today().strftime("%H:%M:%S"),data_cases.to_string(index=False),total.to_string(header=False,index=False))
            _world[1]=datetime.datetime.now()
        except:
            pass
    return _world[0]

def NumberConvert(n):
    return n.replace('0','۰').replace('1','۱').replace('2','۲').replace('3','۳').replace('4','۴').replace('5','۵').replace('6','۶').replace('7','۷').replace('8','۸').replace('9','۹')

def Image(img):
    #subprocess.Popen(['xclip', '-selection', 'clipboard', '-t', 'image/png', '-i', '/run/media/morteza/Morteza/my_projects/WhatsBot/images/mahlol.jpg'])
    return '/images/mahlol.jpg'

def Hospital(city):
    hList=''
    for h in _hospital:
        h=h.split(',')
        if len(h)>5:
            h=h[2:]
            h[-1]=NumberConvert(h[-1][::-1])

            h=','.join(h)
            h.replace('\n','')
            if h.startswith(city):
                hList+=h+'\n'
    if len(hList)>0:
        return hList
    return 'موردی پیدا نشد.'

_getNews=['',datetime.datetime.now()]
def GetNews():
    #if _getNews[0]=='' or datetime.datetime.now()-datetime.timedelta(minutes=10)>_getNews[1]:
    try:
        news=requests.get('https://www.khabaronline.ir/tag/%D9%88%DB%8C%D8%B1%D9%88%D8%B3+%DA%A9%D8%B1%D9%88%D9%86%D8%A7')
        if news.status_code==200:
            soup = BeautifulSoup(news.content, 'html.parser')
            titrs=soup.findAll('h3')
            news=''
            for titr in titrs[:10]:
                news+=titr.get_text()+'\nhttps://www.khabaronline.ir'+titr.find('a')['href']+'\n'
        _getNews[0]="*جدیدترین اخبار مرتبط با ویروس کرونا*\n\n"+news
        _getNews[1]=datetime.datetime.now()
    except:
        pass
    return _getNews[0]

_getArticle=['',datetime.datetime.now()]
def Article(selector):
    if _getArticle[0]=='' or datetime.datetime.now()-datetime.timedelta(hours=1)>_getArticle[1]:
        try:
            req=requests.get('https://corona.ir/')
            _article=''
            if req.status_code==200:
                soup = BeautifulSoup(req.content, 'html.parser')
                soup=soup.select_one(selector)
                articles=soup.findAll('h4')
                for a in articles:
                    _article+=a.get_text()+'\nhttps://corona.ir'+a.find('a')['href']+'\n'
            _getArticle[0]=_article
            _getArticle[1]=datetime.datetime.now()
        except Exception as e:
            print(str(e))
    return _getArticle[0]

def grey_color_func(word, font_size, position, orientation, random_state=None,
                        **kwargs):
        return ("hsl(%d,100%%, 50%%)" % random.randint(0,70))

def _WorldCloud(q):
    fileName='json/all/{}.json'.format(q)
    imgFile='json/img/{}.png'.format(q)
    if not os.path.exists(imgFile):
        if os.path.exists(fileName):
            with open(fileName,'r',encoding='utf-8') as f:
                data=json.load(f)
                myDict={}
                for t in data:
                    myDict[t['name']]=float(t['count'])
                wordcloud = WordCloud(color_func=grey_color_func, max_font_size=250, margin=0,background_color='gray', font_path='segoeui.ttf') .generate_from_frequencies(myDict)
                plt.imshow(wordcloud, interpolation='bilinear')
                plt.axis("off")
                plt.savefig(imgFile,bbox_inches='tight')
        else:
            return 'نام وارد شده اشتباه است.'
    return imgFile



response={
    'سلام' : 'سلام 🙌\nاین یک ربات غیر رسمی برای برای اطلاع رسانی در مورد ویروس کرونا (Covid-19) است که برای آگاهی از آخرین آمار  و کمک به شما برای مراقبت از خود و خانواده تان است.\n\n📧ایمیل سازنده : mortezasaki91@gmail.com\n\nلطفا برای ادامه یکی از گزینه های زیر را انتخاب کنید 👇\n\n*۱*.  همه چیز در مورد کرونا\n*۲*. محافظت در مقابل COVID-19\n*۳*. کار، دانشگاه، مدرسه و مسافرت\n*۴*. قرنطینه در خانه\n*۵*. آمار کرونا\n*۶*. تلفن های ضروری\n*۷*. بیمارستان ها\n*۸*. آموزش ها\n*۹*. اخبار\n*۹۹*. غربالگری و مراقبت کرونا\n*۱۰۰*. مشاوره آنلاین\n*۰*. منوی اصلی\n\n💡برای ادامه یکی از اعداد را ارسال کنید.',
    '0' : 'سلام 🙌\nاین یک ربات غیر رسمی برای برای اطلاع رسانی در مورد ویروس کرونا (Covid-19) است که برای آگاهی از آخرین آمار  و کمک به شما برای مراقبت از خود و خانواده تان است.\n\n📧ایمیل سازنده : mortezasaki91@gmail.com\n\nلطفا برای ادامه یکی از گزینه های زیر را انتخاب کنید 👇\n\n*۱*.  همه چیز در مورد کرونا\n*۲*. محافظت در مقابل COVID-19\n*۳*. کار، دانشگاه، مدرسه و مسافرت\n*۴*. قرنطینه در خانه\n*۵*. آمار کرونا\n*۶*. تلفن های ضروری\n*۷*. بیمارستان ها\n*۸*. آموزش ها\n*۹*. اخبار\n*۹۹*. غربالگری و مراقبت کرونا\n*۱۰۰*. مشاوره آنلاین\n*۰*. منوی اصلی\n\n💡برای ادامه یکی از اعداد را ارسال کنید.',
    '1' : '🦠 *همه چیز در مورد ویروس کرونا* 🦠\n\n*۱۰*. ویروسهای کرونا چیستند؟\n*۱۱*. ویروس COVID-19 چیست؟\n*۱۲*. ویروس چگونه پخش می‌شود؟ \n*۱۳*. ویروس COVID-19 تا چه مدت روی سطوح باقی می‌ماند؟\n*۱۴*. عوارض آن چیست؟\n*۱۵*. عفونت COVID-19 چه مدت طول می‌کشد؟\n*۱۶*. ویروس COVID-19 چگونه تشخیص داده می‌شود؟\n*۱۷*. اگر با کسی که COVID-19 دارد تماس پیدا کردم چه کار باید بکنم؟\n*۱۸*. چه کسی در خطر است؟\n*۱۹*. چگونه می‌شود از آن پیشگیری کرد؟\n\n💡برای ادامه یکی از اعداد  را ارسال کنید.\n\nℹ *منبع* https://www.health.nsw.gov.au/Infectious/diseases/Pages/coronavirus-faqs-persian.aspx',
    '2':'🛡 *محافظت در مقابل COVID-19* 🛡\n\n*۲۰*. چگونه می‌توانم از خودم/خانواده‌ام محافظت کنم؟\n*۲۱*. آیا ماسک صورت در مقابل COVID-19 محافظت می‌کند؟ کدام ماسک صورت؟\n*۲۲*. آیا به اندازه کافی ماسک صورت در ایران هست؟\n*۲۳*. وسایل و اثاثیه بیمارستان چگونه تمیز می‌شود که در مقابل COVID-19 محافظت کند؟\n*۲۴*. آیا رفتن به بیمارستانی که یک مورد COVID-19 در آن است برای من امن است؟\n*۲۵*. از کجا بدانیم کسانی که COVID-19 داشته‌اند دیگر عفونی نیستند؟ \n\n💡برای ادامه یکی از اعداد  را ارسال کنید.\n\nℹ *منبع* https://www.health.nsw.gov.au/Infectious/diseases/Pages/coronavirus-faqs-persian.aspx',
    '3':'🚶‍♂🚶‍♀*کار، دانشگاه، مدرسه و مسافرت* 🚶‍♂🚶‍♀\n\n*۳۰*. من به شهرهایی که کرونا شایع است سفر کرده‌ام. چه کار باید بکنم؟\n*۳۱*. من سفری برای تعطیلات / کار در پیش دارم. آیا باید سفرم را کنسل کنم؟\n*۳۲*. آیا اگر از شهرهایی که کرونا شایع است برگشتم باید خودم را قرنطینه کنم؟\n*۳۳*. اگر نگرانم که COVID-19 دارم آیا می‌توانم آزمایش بشوم؟\n\n💡شما می تونید برای ادامه یکی از اعداد را ارسال کنید.\n\nℹ *منبع* https://www.health.nsw.gov.au/Infectious/diseases/Pages/coronavirus-faqs-persian.aspx',
    '4': '😷 *قرنطینه در خانه* 😷\n\n*۴۰*. اگر قرنطینه شوم آیا باید از سایر افراد در خانه‌ام جدا باشم؟ \n*۴۱*. یکی از اعضای خانواده اخیراً از مسافرت برگشته و خودش را قرنطینه کرده است. آیا من هم باید خودم را قرنطینه کنم؟\n*۴۲*. در مدتی که در خانه قرنطینه هستم چگونه می‌توانم مواد غذایی و داروهایم را تهیه کنم؟\n*۴۳*. وقتی کسی 14 روز قرنطینه را تمام کرده است آیا باید به دکتر عمومی مراجعه کند؟\n\n💡برای ادامه یکی از اعداد را ارسال کنید.\n\nℹ *منبع* https://www.health.nsw.gov.au/Infectious/diseases/Pages/coronavirus-faqs-persian.aspx',
    '5':'📊 *آمار کرونا* 📊\n\n*۵۰*. آمار جهانی کرونا\n*۵۱*. آمار کل مبتلایان به کرونا در ایران\n*۵۲*. آمار روزانه مبتلایان به کرونا در ایران\n*۵۳*. مناطق پرخطر\n\n💡برای ادامه یکی از اعداد را ارسال کنید.',
    '6':'*شماره های ضروری مراکز پاسخگویی در رابطه با کرونا*\nپاسخگویی به سوالات شما درباره کرونا : ۱۹۰\nپاسخگویی به سوالات پزشکی و مشاوره تخصصی : ۴۰۳۰\nپاسخگویی به سوالات عمومی در مورد کرونا : ۱۶۶۶\nاورژانس کشور-اعلام موارد اورژانسی : ۱۱۵\nسازمان امداد و نجات : ۱۱۲\nدریافت خدمات مشاوره روانشناختی : ۱۴۸۰',
    '7':'🏥 *بیمارستان ها* 🏥\n\n💡برای مشاهده لیست بیمارستهای پذیرش بیماران کرونا به صورت زیر عمل کنید👇\n*بیمارستان نام شهر* مانند:\nبیمارستان تهران',
    '8':'💡 *آموزش ها* 💡\n\n*۸۰*. آموزش ساخت محلول ضد عفونی کننده\n*۸۱*. پیشگیری: خانه، محیط و پیرامون\n*۸۲*. بیمار شدیم؟ در خانه بیمار داشتیم؟\n*۸۳*. آخرین مقالات\n\n💡برای ادامه یکی از اعداد را ارسال کنید.',
    '9':GetNews(),

    '10':'ویروسهای کرونا یک فامیل بزرگ ویروسند. بعضی از ویروسهای کرونا در انسان بیماری ایجاد می‌کنند و سایر آنها در حیواناتی مثل خفاشها، شترها، و گربه‌های زباد. ویروسهای کرونای انسان معمولاً بیماری ملایمی ایجاد می‌کنند، مثل سرما خوردگی ساده.\nبه ندرت، ویروسهای کرونای حیوانی تکامل پیدا می‌کنند تا انسانها را عفونی کنند و بین انسانها پخش شوند و بیماریهای شدیدی را ایجاد کنند مثل Severe Acute Respiratory Syndrome (SARS) (سندروم تنفسی شدید) که در سال 2002 ظاهر شد و Middle East Respiratory Syndrome (MERS) (سندروم تنفسی خاور میانه) که در سال 2012 ظاهر شد.',
    '11':'ویروس COVID-19 یک گونه جدید ویروس کرونا است که قبلاً در انسان شناخته نشده بوده. این ویروس برای اولین بار در ووهان، استان هوبی در چین شناخته شد و در آنجا باعث شیوع وسیع و مداومی شده است. از آن پس بصورت وسیع تری در چین پخش شده و موارد آن در چندین کشور دیگر نیز دیده شده است. ویروس COVID-19 ارتباط نزدیکی با ویروس کرونای خفاش دارد.\nهنوز چیزهای زیادی هست که باید در باره نحوه شیوع COVID-19، شدت آن، و ویژگی‌های دیگر ویروس فرا گرفته شود؛ پژوهشهای اپیدمیولوژیک و بالینی در جریانند.\nشیوع عفونتهای جدید ویروس کرونا بین مردم همیشه باعث نگرانی بهداشت عمومی است. اوضاع به سرعت در حال تحول است.',
    '12':'ویروسهای کرونای انسان از طریق قطره‌های آلوده که با سرفه یا عطسه پخش می‌شوند، یا تماس با دستها، سطوح یا اشیاء آلوده از کسی که ویروس کرونا دارد به دیگرانی که با او تماس نزدیک دارند منتقل می‌شوند.\nفاصله زمانی بین وقتی که یک نفر در معرض ویروس قرار می‌گیرد تا وقتی که عوارض برای اولین بار ظاهر می‌شوند معمولاً 5 تا 6 روز است، اگر چه می‌تواند از 2 تا 14 روز باشد. به این دلیل، از کسانی که احتمالاً با یک مورد تایید شده تماس داشته‌اند خواسته می‌شود که خودشان را برای 14 روز قرنطینه کنند.\nبه نظر می‌رسد که بیشتر موارد COVID-19 از کسانی که عوارض داشته‌اند پخش می‌شود. تعداد کمی از افراد ممکن است قبل از ظهور عوارضشان عفونی بوده باشند.',
    '13':'به گفته سازمان بهداشت جهانی، اطمینانی نیست که ویروسی که باعث COVID-19 می‌شود چه مدت روی سطوح زنده می‌ماند، ولی به نظر می‌رسد که مثل سایر ویروسهای کرونا عمل می‌کند. مطالعات (از جمله اطلاعات مقدماتی در باره ویروس COVID-19) نشان می‌دهد که ویروسهای کرونا ممکن است از چند ساعت تا چند روز روی سطوح باقی بمانند. این ممکن است در شرایط مختلف فرق کند (مثلاً نوع سطح، حرارت و رطوبت محیط).\nاگر فکر می‌کنید که سطحی آلوده است، آن را با یک ماده ضد عفونی کننده خانگی رایج تمیز کنید تا ویروس را بکشید و از خودتان و دیگران محافظت کنید. دست هاتان را با یک ژل ضد عفونی کننده الکلی تمیز کنید یا با آب و صابون بشویید. از زدن دست به چشمها، دهان و بینی تان اجتناب کنید.',
    '14':'بیماران ممکن است تب، سرفه، آبریزش بینی، تنگی نفس و عوارض دیگری داشته باشند.\nدر موارد شدید تر، عفونت می‌تواند باعث ذات‌الریه همراه با ناراحتی شدید و حاد تنفسی بشود.',
    '15':'مدت عفونت بین افراد مختلف فرق می‌کند. عوارض ملایم در یک شخص سالم ممکن است در ظرف چند روز رفع شود. مشابه با آنفلوآنزا، برای کسی که مسایل بهداشتی دیگری مانند یک بیماری تنفسی دارد، بهبودی ممکن است هفته‌ها طول بکشد و در موارد شدید می‌تواند بالقوه کشنده باشد.',
    '16':'عفونت COVID-19 با پیدا کردن شواهد ویروس در نمونه‌های تنفسی مثل سواب از پشت بینی و حلق یا مایع از شش‌ها تشخیص داده می‌شود. آزمایش برای COVID-19 در آزمایشگاههای بهداشت عمومی انجام می‌شود.',
    '17':'اگر شما بعنوان کسی شناخته شوید که با شخصی تماس داشته که عفونت COVID-19 او تایید شده است، واحد بهداشت عمومی محلی با شما برای راهنمایی تماس خواهد گرفت. شما باید خودتان را در خانه برای 14 روز بعد از تماس با شخص آلوده قرنطینه کنید و سلامت خود را تحت نظر بگیرید و اگر عوارض ظاهر شد آن را گزارش بدهید.\nانتقال شخص به شخص ویروسهای کرونا عموماً بین کسانی صورت می‌گیرد که با هم   تماس نزدیک داشته‌اند. طرف تماس نزدیک معمولاً کسی است که با یک شخص عفونی حداقل 15 دقیقه رو در رو بوده‌ یا برای حد اقل 2 ساعت با او در یک محیط بسته بوده است. واحد بهداشت عمومی با کسانی که طرف تماس نزدیک بیماران COVID-19 بوده‌اند در تماس خواهد بود. اگر عوارض ظاهر شدند، آن طرفهای تماس باید به واحد بهداشت محلی تلفن بزنند و عوارض را گزارش بدهند.\nاگر تماس شما با آن شخص کمتر از این بوده، خطر عفونت در شما خیلی کمتر است. اما بعنوان یک احتیاط، شما باید هنوز سلامتی تان را برای 14 روز بعد از آخرین باری که با شخص عفونی بودید تحت نظر بگیرید.  اگر عوارض در شما ظاهر شد، از جمله تب و/یا علائم تنفسی لطفاً به یک دکتر یا شماره 4030 تلفن بزنید. به دکترتان بگویید که با کسی تماس داشته‌اید که COVID-19 دارد. دکتر ممکن است به شما بگوید که به نزدیک ترین بخش اورژانس بروید. اگر اینطور بود، قبل از رفتن به آنجا تلفن بزنید.',
    '18': 'کسانی که:\n⚫با شخصی که COVID-19 دارد تماس داشته‌اند\n⚫در 14 روز گذشته از کشور چین (به استثنای ماکائو یا تایوان) دیدن کرده‌اند یا در ترانزیت بوده‌اند\n⚫در 14 روز گذشته در ایران بوده یا در ترانزیت بوده‌اند\n⚫در 14 روز گذشته از کشور دیگری که در خطر COVID-19 است دیدن کرده‌اند\nافراد مبتلا به بیماری‌های اساسی که آنها را بیشتر در خطر ابتلا به بیماری‌های تنفسی قرار می‌دهد، از جمله کسانی که به بیماری قند، بیماری مزمن شش، نارسایی کلیه مبتلا هستند، کسانی که سیستم ایمنی سرکوب شده دارند و اشخاص مسن تر بیشتر در خطر بیماری شدید هستند.',
    '19':'دستهایتان را برای 20 ثانیه با آب و صابون یا ژل ضد عفونی کننده الکلی تمیز کنید.\nوقتی سرفه یا عطسه می‌کنید بینی و دهانتان را با دستمال کاغذی یا آرنج تا شده خود بپوشانید.\nاز تماس نزدیک با هر کسی که عوارض شبیه سرماخوردگی یا آنفلوآنزا دارد اجتناب کنید.\nاتیکت سرفه را رعایت کنید (از سایرین دور شوید، سرفه و عطسه را با دستمال کاغذی یا لباس بپوشانید) و دستهایتان را تمیز کنید.',

    '20':'بهترین راه محافظت همان است که برای هر عفونت تنفسی انجام می‌دهید. بهداشت خوب را از این طریق رعایت کنید:\nمطمئن شوید که حد اقل برای 20 ثانیه با آب و صابون یا ژل ضد عفونی کننده الکلی دستهایتان را کاملاً تمیز کنید\nوقتی سرفه یا عطسه می‌کنید بینی و دهانتان را با دستمال کاغذی یا آرنج تا شده خود بپوشانید\nاز تماس نزدیک با هر کسی که عوارضی شبیه سرما خوردگی یا آنفلوآنزا دارد اجتناب کنید.\nمطمئن شوید که اگر مریض هستید در خانه بمانید.',
    '21':'ماسک صورت برای عموم جامعه توصیه نمی‌شود.\nکسانی که عوارض دارند و ممکن است به COVID-19 آلوده باشند ملزم هستند که در خانه قرنظینه باشند و باید وقتی با کس دیگری در یک اتاق هستند و وقتی خواستار راهنمایی پزشکی هستند ماسک صورت جراحی بپوشند تا خطر انتقال COVID-19 به کس دیگری را کاهش دهند.\nکارکنان  مراقبت بهداشتی که مراقب بیماران مشکوک به COVID-19 هستند باید از وسایل محافظت شخصی مناسب استفاده کنند تا از خودشان در مقابل COVID-19 محافظت کنند.',
    '22':'وزارت بهداشت موجودی ماسکها را تحت نظر دارد',
    '23': 'بیمارستانها مطمئن می‌شوند که سطوح بعد از هر مورد مشکوک تمیز و ضد عفونی شوند، آمبولانس‌ها هم همینطور. یک کتابچه راهنمای پیشگیری و کنترل عفونت هست که قدمهای مناسب برای تمیز کردن یک اتاق را بمنظور حتمی کردن اینکه هیچ ویروسی باقی نمانده باشد شرح می‌دهد. کارکنان در هنگام تمیز کردن لباس محافظ نیز می‌پوشند تا از خودشان محافظت کرده و هر نوع پخش عفونت را محدود نمایند.',
    '24':'سعی کنید تا زمان کاهش خطر کرونا کمتر به بیمارستانها مراجعه کنید',
    '25':'افرادی که عفونت COVID-19 در آنها تایید شده است تحت مراقبت پزشکان متخصص در قرنطینه می‌مانند تا عوارض عفونت COVID-19 در آنها تمام شود. پیش از ترخیص از قرنطینه آزمایشاتی دارند تا معلوم شود که هنوز COVID-19 دارند یا نه و تیم مراقبت تخصصی ارزیابی می‌کند که دیگر عفونی نیستند. پس از مرخص شدن تیم پزشکی یک ارزیابی پیگیری انجام می‌دهد تا اطمینان حاصل شود که آنها همچنان خوب باقی می‌مانند.',

    '30': 'به مدت 14 روز از تاریخی که از چین یا ایران خارج شدید خودتان را از دیگران جدا کنید، و مراقب ظهور عوارض در خودتان باشید.\n​اگر تب یا عوارض تنفسی شدید در شما ظاهر شد لطفاً به دکترتان، بخش اورژانس یا به شماره 4030 تلفن بزنید. به کسی که تلفن را جواب می‌دهد بگویید که کجا سفر کرده‌اید. مهم است که اگر عوارض دارید سر کار، مدرسه/دانشگاه، سالن ورزش یا اماکن عمومی نروید و نباید از وسایل نقلیه عمومی، تاکسی یا سرویسهای سواری مشترک استفاده کنید. اگر نیاز به مراقبت پزشکی دارید در هنگام حضور در مطب ماسک بپوشید.',
    '31':'تا زمان برطرف شدن خطر سفرهای خود را لغو کنید',
    '32':'در خانه بمانید و خودتان را از دیگران جدا کنید. باید مراقب ظهور عوارض باشید.\nاگر در طی 14 روز از سفر به یک محل تحت تاثیر تب، سرفه، گلودرد یا تنگی نفس در شما ایجاد شد به دکتر یا به شماره 4030 تلفن بزنید و در اسرع وقت راهنمایی پزشکی بگیرید.\nمهم است که قبل از رفتن تلفن بزنید تا مطب یا بخش اورژانس بتواند آمادگی‌های مناسب را فراهم کرده و از دیگران محافظت کند.\nوقتی برای راهنمایی پزشکی مراجعه می‌کنید ماسک بپوشید یا وقتی رسیدید ماسک درخواست کنید.',
    '33':'اگر دچار تب، سرفه، آبریزش بینی، تنگی نفس و عوارض دیگر بشوید، باید به دکتر عمومی تان یا بخش اورژانس محلی مراجعه کنید تا برای COVID-19 آزمایش بشوید.',
    
    '40': 'بله. اگر در خانه مشترکاً با کسان دیگری زندگی می‌کنید باید در اتاق دیگری بمانید یا تا آنجا که ممکن است از افراد دیگر فاصله بگیرید. وقتی با شخص دیگری در یک اتاق هستید و وقتی برای مراقبت پزشکی می‌روید ماسک بپوشید. اگر امکانش هست، از توالت دیگری استفاده کنید.\nمطمئن شوید که با کسانی که در خطر بیماری شدید هستند مانند افراد سالمند و کسانی که بیماری‌های قلب، شش یا کلیه، و مرض قند دارند در یک اتاق نباشید.\nدیدار کنندگانی که نیاز ضروری به بودن در خانه شما ندارند نباید در مدتی که قرنطینه هستید دیدن کنند.',
    '41':'سایر اعضای خانوار ملزم نیستند که خودشان را قرنطینه کنند',
    '42':'اگر مواد غذایی و دارو (از جمله داروهای تجویزی) لازم دارید از یک عضو خانواده یا دوست (که در قرنطینه نیست) خواهش کنید که برایتان به خانه بیاورد یا مواد غذایی را آنلاین بخرد. برای پیشگیری از آلوده کردن سایر افراد، مطمئن شوید که وقتی محموله‌ای را دریافت می‌کنید ماسک بپوشید یا ترتیبی بدهید که مواد غذایی پشت در گذاشته شود.',
    '43':'اگر در پایان 14 روز قرنطینه شخصی حالتان خوب است می‌توانید زندگی عادی خود را از سر بگیرید.',

    '50':World(),
    '51':'آمار کل مبتلایان به کرونا در کشور به تاریخ {} به تفکیک استانها\n💡از تاریخ ۴ فروردین آمار تفکیکی استانها اعلام نمیشود\nتعداد کل مبتلایان : {:,} نفر\nتعداد کل بهبودی های : {:,} نفر\n تعداد کل فوتی ها  : {:,} نفر\n{}'.format(Today(),29406,10457,2234, PrettyPrint(Total())),
    '52':'آمار مبتلایان به کرونا در کشور به تاریخ {} به تفکیک استانها\n💡از تاریخ ۴ فروردین آمار تفکیکی استانها اعلام نمیشود\nتعداد کل مبتلایان : {:,} نفر\nتعداد کل بهبودی های : {:,} نفر\n تعداد کل فوتی ها  : {:,} نفر\n{}'.format(Today(),2389,832,157, PrettyPrint(TodayStatis())),
    '53':'برای نمایش مناطق پر خطر بعد از کلمه شیوع نام ایران، استان و یا شهر خود را وارد و ارسال کنید. مانند:\n\nشیوع ایران\nشیوع لرستان\nشیوع مشهد',

    '80': Image('mahlol.jpg'),
    '81': Article('section.home:nth-child(6)'),
    '82': Article('section.home:nth-child(8)'),
    '83':Article('section.home:nth-child(4)'),

    '99':'برای غربالگری به سایت زیر مراجعه کنید\n\nhttps://salamat.gov.ir/',
    '100':'برای مشاوره آنلاین به سایت زیر مراجعه کنید\n\nhttps://iranmd.ir/'

}
